
-- 유저 데이터 삽입 (40명)
INSERT INTO "user" (name)
VALUES
    ('유재석'),
    ('박명수'),
    ('정준하'),
    ('정형돈'),
    ('하하'),
    ('노홍철'),
    ('길'),
    ('양세형'),
    ('유희열'),
    ('이효리'),
    ('김종국'),
    ('송지효'),
    ('전소민'),
    ('양세찬'),
    ('김남길'),
    ('이광수'),
    ('지석진'),
    ('김신영'),
    ('조세호'),
    ('김영철'),
    ('이국주'),
    ('김구라'),
    ('박나래'),
    ('홍진경'),
    ('이상준'),
    ('김준호'),
    ('이용진'),
    ('장도연'),
    ('김동현'),
    ('샘 해밍턴'),
    ('김민경'),
    ('김수용'),
    ('김지민'),
    ('안영미'),
    ('유병재'),
    ('박보검'),
    ('송강호'),
    ('이정재'),
    ('황정민'),
    ('마동석');


-- 강의 데이터 삽입
INSERT INTO lecture (title, description, instructor, enrollment_count, capacity, start_time)
VALUES ('자바 기초', '자바 기초에 대해서 배운다', '홍길동', 0, 30, NOW()),
       ('스프링부트', '스프링부트 심화 과정', '링링링', 0, 30, NOW());
